
<script>

result: [
    班级1:{
        班级号码: xxx,
        学生: [
            学生1: {
                姓名: xxx,
                    年龄: xx,
                    性别: x
            },
            学生2: {
                姓名: xxx,
                    年龄: xx,
                    性别: x
            },....
        ]
    },
    班级2:{
        班级号码: xxx,
        学生: [
            学生1: {
                姓名: xxx,
                    年龄: xx,
                    性别: x
            },
            学生2: {
                姓名: xxx,
                    年龄: xx,
                    性别: x
            },....
        ]
    },...
]

</script>